cs241/notes.org
* Memory
   1. What is the difference between physical and virtual memory?
   2. What are common memory allocation algorithms and what are the advantages of each?
   3. How are virtual addresses translated to physical addresses in multi-level page tables?
   4. How do page size and the number of levels of page tables affect
      the number of entries in a page table?
   5. What is the difference between internal and external fragmentation?
   6. What are the different page replacement policies and the
      advantages of each?
   7. Describe how the buddy system works and the run time for its operations.
   8. What is thrashing? When does it occur?
   9. What causes a SEGFAULT and what happens when one occurs?
   10. When is a process swapped out to disk?
   11. What is the difference between the MMU and the TLB? Describe
       the function of each.
   12. Name three benefits of virtual memory (as opposed to allowing
       programs to directly access physical memory).
   13. Name one advantage of segmentation over paging, and one
       advantage of paging over segmentation.
   14. How is a page table similar to an inode? What is the difference
       between these structures?
   15. Assuming a 32-bit address space and 4 KB pages, what is the
       virtual page # and offset for virtual address 0xd34f6a5?
   16. Give an example of a page fault that is an error, and an
       example of a page fault that is not an error.
   17. Assume LRU page eviction and three pages of physical
       memory. Describe what happens
   18. when the application accesses virtual memory pages in this
       sequence: 3,4,5,4,1,6,9,3,9,8,4,8,8,2.
   19. How many page faults occur in the above example?
   20. Why are pages set to read-only in the copy-on-write technique?
   21. Suppose we have a 64-bit address space and 16 KB pages. How big
       is the page table of a single process, if the system uses
       single-level page tables? What is the problem here? How would multi-level page tables help solve this problem?
   22. Which page replacement scheme is better, OPT or LRU? Why?
   23. Why does LRU not suffer from Belady’s anomaly?
   24. How does the virtual memory subsystem know the exact location
       where a particular page is stored on disk, if it is swapped out of memory?
   25. How is the working set computed? How is the notion of a working
       set useful for managing memory of processes?
   26. Compare and contrast (give one benefit and one disadvantage)
       for: implicit, explicit, segregated, and buddy free lists. 
* Processes and Threads
   1. What resources are shared between threads of the same process?
   2. Invent some code using pthread_create() statements. What could be
      its output?
   3. What are the possible values for X after both threads complete
      execution? (X is a global
      variable and initially X = 0.)
   4. What happens when a thread calls exit()?
   5. What happens to a process’s resources when it terminates normally?
   6. Describe what happens when a process calls fork(). Be able to trace
      through the code.
   7. Under what conditions would a process exit normally?
   8. Explain the actions needed to perform a process context switch.
   9. Explain the actions needed to perform a thread process switch.
   10. What are the advantages and disadvantages of kernel-level threads
       over user-level threads?
   11. Compare the use of fork() to the use of pthread_create().
   12. In a multiprocessor system, what system characteristics will cause
       other threads of the same
       process to block?
   13. How can a process become orphaned and what does the OS do with it?
       What's a zombie?
   14. Write a piece of code using fork() to create a process tree of
       depth n, where each process (a node in the tree) except for the
       "leaf" processes has exactly m child processes.
   15. Describe how to use the POSIX call wait().
   16. Explain what happens when a process calls exec().
   17. Explain how reentrant functions are used in C.
   18. What are the maximum number of threads that can be run
       concurrently? How is this number determined?
   19. If a process spawns a number of threads, in what order will these
       threads run?
   20. Explain how to use pthread_detach() and pthread_join().
   21. Explain how a shell process can execute a different program
       without using system().
   22. Explain how one process can wait on the return value of another
       process.
   23. Describe the transitions between running, ready and blocked in the
       5 state model.
   24. Understand how pthread_exit() differs from exit().
* Scheduling
   1. What is starvation? Which scheduling policies have the possibility
      of resulting in starvation?
   2. Which scheduling algorithm results the smallest average wait time?
   3. What scheduling algorithm has the longest average response time?
   4. Define turnaround time, waiting time and response time in the
      context of scheduling algorithms.
   5. What is the convoy effect?
   6. Why do processes need to be scheduled?
   7. How does bounded wait apply to scheduling?
   8. Which scheduling algorithm minimizes average initial response time?
      Waiting time? Total response time?
   9. Why is SJF/PSJF hard to implement in real systems?
   10. What does it mean to preempt a process?
   11. What does it mean for a scheduling algorithm to be preemptive?
   12. Describe Round-Robin scheduling and its performance advantages
       and disadvantages.
   13. Describe the First Come First Serve (FCFS) scheduling
       algorithm. Explain the performance advantages and disadvantages.
   14. Describe the Pre-emptive and Non-preemptive SJF scheduling
       algorithms. Explain the performance advantages and disadvantages.
   15. Describe the Preemptive Priority-based scheduling
       algorithm. Explain the performance advantages and disadvantages.
   16. How does the length of the time quantum affect Round-Robin
       scheduling?
   17. Define fairness in terms of scheduling algorithms. What are the
       fairness properties of each of the scheduling disciplines discussed in class?
   18. Which scheduling algorithms guarantee progress?
   19. A process was switched from running to ready state. Describe the
       characteristics of the scheduling algorithm being used.
   20. Which properties of scheduling algorithms affect the performance
       of interactive systems?

* Synchronization
   1. What is the readers-writers problem?
   2. What is the producers-consumers problem?
   3. What is the dining philosopher problem?
   4. Recognize a correct solution to the readers-writers problem, the
    producers-consumers problem, and the dining philosopher. Be able
    to identify and explain an error in a specific implementation of any of the classic synchronization problems.
   5. What happens when readers are prioritized over writers in the
      classic “readers writer problem”? How about if writers are prioritized over readers?
   6. What is required so that deadlock and starvation do not occur in
      the dining philosopher’s problem? Give examples of solutions.
   7. What is the difference between starvation, deadlock, race
      conditions and critical sections? Describe each.
   8. What would happen if a system’s hardware synchronization primitive were replaced with a software function?
   9. Which type of variables must be protected against concurrent
    readers and writers in any combination?
   10. Given two threads running example code that contains a critical
     section, be able to identify if progress and mutual exclusion are ensured.
