cs241/notes.tex
\section{Memory}
\label{sec-9}

\begin{enumerate}
\item What is the difference between physical and virtual memory?
\item What are common memory allocation algorithms and what are the advantages of each?
\item How are virtual addresses translated to physical addresses in multi-level page tables?
\item How do page size and the number of levels of page tables affect
      the number of entries in a page table?
\item What is the difference between internal and external fragmentation?
\item What are the different page replacement policies and the
      advantages of each?
\item Describe how the buddy system works and the run time for its operations.
\item What is thrashing? When does it occur?
\item What causes a SEGFAULT and what happens when one occurs?
\item When is a process swapped out to disk?
\item What is the difference between the MMU and the TLB? Describe
       the function of each.
\item Name three benefits of virtual memory (as opposed to allowing
       programs to directly access physical memory).
\item Name one advantage of segmentation over paging, and one
       advantage of paging over segmentation.
\item How is a page table similar to an inode? What is the difference
       between these structures?
\item Assuming a 32-bit address space and 4 KB pages, what is the
       virtual page \# and offset for virtual address 0xd34f6a5?
\item Give an example of a page fault that is an error, and an
       example of a page fault that is not an error.
\item Assume LRU page eviction and three pages of physical
       memory. Describe what happens
\item when the application accesses virtual memory pages in this
       sequence: 3,4,5,4,1,6,9,3,9,8,4,8,8,2.
\item How many page faults occur in the above example?
\item Why are pages set to read-only in the copy-on-write technique?
\item Suppose we have a 64-bit address space and 16 KB pages. How big
       is the page table of a single process, if the system uses
       single-level page tables? What is the problem here? How would multi-level page tables help solve this problem?
\item Which page replacement scheme is better, OPT or LRU? Why?
\item Why does LRU not suffer from Belady’s anomaly?
\item How does the virtual memory subsystem know the exact location
       where a particular page is stored on disk, if it is swapped out of memory?
\item How is the working set computed? How is the notion of a working
       set useful for managing memory of processes?
\item Compare and contrast (give one benefit and one disadvantage)
       for: implicit, explicit, segregated, and buddy free lists.
\end{enumerate}
\section{Processes and Threads}
\label{sec-10}

\begin{enumerate}
\item What resources are shared between threads of the same process?
\item Invent some code using pthread$_{\mathrm{create}}$() statements. What could be
      its output?
\item What are the possible values for X after both threads complete
      execution? (X is a global
      variable and initially X = 0.)
\item What happens when a thread calls exit()?
\item What happens to a process’s resources when it terminates normally?
\item Describe what happens when a process calls fork(). Be able to trace
      through the code.
\item Under what conditions would a process exit normally?
\item Explain the actions needed to perform a process context switch.
\item Explain the actions needed to perform a thread process switch.
\item What are the advantages and disadvantages of kernel-level threads
       over user-level threads?
\item Compare the use of fork() to the use of pthread$_{\mathrm{create}}$().
\item In a multiprocessor system, what system characteristics will cause
       other threads of the same
       process to block?
\item How can a process become orphaned and what does the OS do with it?
       What's a zombie?
\item Write a piece of code using fork() to create a process tree of
       depth n, where each process (a node in the tree) except for the
       ``leaf'' processes has exactly m child processes.
\item Describe how to use the POSIX call wait().
\item Explain what happens when a process calls exec().
\item Explain how reentrant functions are used in C.
\item What are the maximum number of threads that can be run
       concurrently? How is this number determined?
\item If a process spawns a number of threads, in what order will these
       threads run?
\item Explain how to use pthread$_{\mathrm{detach}}$() and pthread$_{\mathrm{join}}$().
\item Explain how a shell process can execute a different program
       without using system().
\item Explain how one process can wait on the return value of another
       process.
\item Describe the transitions between running, ready and blocked in the
       5 state model.
\item Understand how pthread$_{\mathrm{exit}}$() differs from exit().
\end{enumerate}
\section{Scheduling}
\label{sec-11}

\begin{enumerate}
\item What is starvation? Which scheduling policies have the possibility
      of resulting in starvation?
\item Which scheduling algorithm results the smallest average wait time?
\item What scheduling algorithm has the longest average response time?
\item Define turnaround time, waiting time and response time in the
      context of scheduling algorithms.
\item What is the convoy effect?
\item Why do processes need to be scheduled?
\item How does bounded wait apply to scheduling?
\item Which scheduling algorithm minimizes average initial response time?
      Waiting time? Total response time?
\item Why is SJF/PSJF hard to implement in real systems?
\item What does it mean to preempt a process?
\item What does it mean for a scheduling algorithm to be preemptive?
\item Describe Round-Robin scheduling and its performance advantages
       and disadvantages.
\item Describe the First Come First Serve (FCFS) scheduling
       algorithm. Explain the performance advantages and disadvantages.
\item Describe the Pre-emptive and Non-preemptive SJF scheduling
       algorithms. Explain the performance advantages and disadvantages.
\item Describe the Preemptive Priority-based scheduling
       algorithm. Explain the performance advantages and disadvantages.
\item How does the length of the time quantum affect Round-Robin
       scheduling?
\item Define fairness in terms of scheduling algorithms. What are the
       fairness properties of each of the scheduling disciplines discussed in class?
\item Which scheduling algorithms guarantee progress?
\item A process was switched from running to ready state. Describe the
       characteristics of the scheduling algorithm being used.
\item Which properties of scheduling algorithms affect the performance
       of interactive systems?
\end{enumerate}
\section{Synchronization}
\label{sec-12}

\begin{enumerate}
\item What is the readers-writers problem?
\item What is the producers-consumers problem?
\item What is the dining philosopher problem?
\item Recognize a correct solution to the readers-writers problem, the
    producers-consumers problem, and the dining philosopher. Be able
    to identify and explain an error in a specific implementation of any of the classic synchronization problems.
\item What happens when readers are prioritized over writers in the
      classic “readers writer problem”? How about if writers are prioritized over readers?
\item What is required so that deadlock and starvation do not occur in
      the dining philosopher’s problem? Give examples of solutions.
\item What is the difference between starvation, deadlock, race
      conditions and critical sections? Describe each.
\item What would happen if a system’s hardware synchronization primitive were replaced with a software function?
\item Which type of variables must be protected against concurrent
    readers and writers in any combination?
\item Given two threads running example code that contains a critical
     section, be able to identify if progress and mutual exclusion are ensured.
\end{enumerate}
