cs241/notes.org
* Mutexes and Semaphores
   1. Understand the common semaphore and mutex functions (sem_wait(),
      sem_post(), etc).
   2. How does a semaphore perform, in both the parent and child, after
      a fork()?
   3. What are proper and improper code replacements for a
     test_and_set() operation?
   4. How does the internal counter of a POSIX semaphore work? What does
    it mean if the value of the semaphore is 1?
   5. How can the reader-writer problem be solved using only POSIX mutexes?
   6. Using only one mutex, is it possible to create a semaphore? If
      so, how? If not, why?
   7. Understand how to solve the producer-consumer problem using
      mutexes and semaphores.
   8. What is a buffer overflow? What is a buffer underflow? Understand how failures in synchronization could cause buffer over and underflows.
   9. What is progress?
   10. What is mutual exclusion?
   11. What are condition variables? Understand how they can be used in
     code.
   12. Understand how to fix deadlocks and starvation in code involving mutexes, semaphores, and conditional variables.

* Processes and Deadlock
   1. Define deadlock.
   2. Define circular wait, mutual exclusion, hold and wait, and no
      preemption. How are these related to deadlock?
   3. How would the implementation of a web server using threads differ from one using processes?
   4. What can happen if synchronization in a multiple-threaded program is not programmed carefully?
   5. Why might an operating system use a resource allocation graph?
   6. What are the conditions of a deadlock? How could you guarantee that each one of these conditions can be prevented?
   7. What does waitpid() do?
   8. What are the approaches for solving deadlock?
   9. What is the difference between Deadlock Prevention, Deadlock
      Detection & Recovery, and Deadlock Avoidance? What deadlock handling mechanism would you use?
   10. What are the components of a resource allocation graph?
   11. What problem does the Banker’s Algorithm solve? Given a set of
     processes how would you use the Banker’s Algorithm?
   12. What is a safe state and how can you determine if a system is in a
     safe state?

* IPC
   1. What is the difference between a FIFO and a pipe?
   2. How would you redirect standard out to a file?
   3. What is the difference between a pipe, a FIFO, and an ordinary file on disk?
   4. What happens when two processes read and write to a memory
      mapped file?
   5. Explain how two processes can share memory using shmem.
   6. Explain how a process can set which signals are caught or
      ignored using a signal set.
   7. How can one process send a signal to another?
   8. Describe the purpose of a POSIX signal.
   9. Some signals cannot caught or ignored. Which signals are they and
      why shouldn’t they be allowed to be caught?
   10. What does “kill -<parameter> pid” do?
   11. How is the function sigwait() used?
   12. How does the function alarm() work?

* Networking
   1. When do you use the close() system call with sockets?
   2. Discuss how a multithreaded web server running on a single
      processor system could be optimized using the process scheduling
      methods discussed in class. Which do you recommend?
   3. How do select() and poll() work? What problem do they it solve?
   4. Describe the Posix accept() function.
   5. How does HTTP work?
   6. Describe the services provided by TCP.
   7. How does TCP connection establishment work?
   8. Describe the services provided by UDP.
   9. Explain the difference between a regular and a connected UDP socket.
   10. How do sockets support the client-server model?
   11. Which is better, UDP or TCP? Which one would you use?
   12. How does the Domain Name System (DNS) work?
   13. How does DNS use caching?
   14. How is DNS related to IP?
* File systems and I/O
1. Given a description of the block size and i-node structure, what is the maximum size of a file?
2. How many i-node operations are required to fetch a file at /path/to/file?
3. What information is stored in an i-node? What information isn’t?
4. What data structure best describes an i-node?
5. What are the advantages and disadvantages of an i-node based file system?
6. Given the description of an i-node file system, how many i-node
   accesses are required to read the entire contents of a file of a
   given size? How many blocks does this file consume on disk?
7. What is an advantage of a soft link over a hard link?
8. What is I/O polling? What are advantages and disadvantages?
9. Describe disk I/O access using DMA.
10. How are file descriptors shared between threads in a single
    process? How are they shared between after a process executes a fork()?
12. When the size of a block changes in an i-node based file system,
    how does this change the maximum size of a file?
13. How do polling and interrupt driven I/O differ? What are the
    advantages and disadvantages of each?
14. How does the page-out process work?
15. Understand how hard-links result in different file names affecting
    the same i-node.
16. If an i-node based file system has a certain number of direct and
    single-indirect blocks, how large is the file?
17. Where does fstat() look to find the information that it returns?
18. How does a file system use caching?

