cs241/notes.tex
\section{Mutexes and Semaphores}
\label{sec-13}

\begin{enumerate}
\item Understand the common semaphore and mutex functions (sem$_{\mathrm{wait}}$(),
      sem$_{\mathrm{post}}$(), etc).
\item How does a semaphore perform, in both the parent and child, after
      a fork()?
\item What are proper and improper code replacements for a
     test$_{\mathrm{and}}$$_{\mathrm{set}}$() operation?
\item How does the internal counter of a POSIX semaphore work? What does
    it mean if the value of the semaphore is 1?
\item How can the reader-writer problem be solved using only POSIX mutexes?
\item Using only one mutex, is it possible to create a semaphore? If
      so, how? If not, why?
\item Understand how to solve the producer-consumer problem using
      mutexes and semaphores.
\item What is a buffer overflow? What is a buffer underflow? Understand how failures in synchronization could cause buffer over and underflows.
\item What is progress?
\item What is mutual exclusion?
\item What are condition variables? Understand how they can be used in
     code.
\item Understand how to fix deadlocks and starvation in code involving mutexes, semaphores, and conditional variables.
\end{enumerate}
\section{Processes and Deadlock}
\label{sec-14}

\begin{enumerate}
\item Define deadlock.
\item Define circular wait, mutual exclusion, hold and wait, and no
      preemption. How are these related to deadlock?
\item How would the implementation of a web server using threads differ from one using processes?
\item What can happen if synchronization in a multiple-threaded program is not programmed carefully?
\item Why might an operating system use a resource allocation graph?
\item What are the conditions of a deadlock? How could you guarantee that each one of these conditions can be prevented?
\item What does waitpid() do?
\item What are the approaches for solving deadlock?
\item What is the difference between Deadlock Prevention, Deadlock
      Detection \& Recovery, and Deadlock Avoidance? What deadlock handling mechanism would you use?
\item What are the components of a resource allocation graph?
\item What problem does the Banker’s Algorithm solve? Given a set of
     processes how would you use the Banker’s Algorithm?
\item What is a safe state and how can you determine if a system is in a
     safe state?
\end{enumerate}
\section{IPC}
\label{sec-15}

\begin{enumerate}
\item What is the difference between a FIFO and a pipe?
\item How would you redirect standard out to a file?
\item What is the difference between a pipe, a FIFO, and an ordinary file on disk?
\item What happens when two processes read and write to a memory
      mapped file?
\item Explain how two processes can share memory using shmem.
\item Explain how a process can set which signals are caught or
      ignored using a signal set.
\item How can one process send a signal to another?
\item Describe the purpose of a POSIX signal.
\item Some signals cannot caught or ignored. Which signals are they and
      why shouldn’t they be allowed to be caught?
\item What does “kill -<parameter> pid” do?
\item How is the function sigwait() used?
\item How does the function alarm() work?
\end{enumerate}
\section{Networking}
\label{sec-16}

\begin{enumerate}
\item When do you use the close() system call with sockets?
\item Discuss how a multithreaded web server running on a single
      processor system could be optimized using the process scheduling
      methods discussed in class. Which do you recommend?
\item How do select() and poll() work? What problem do they it solve?
\item Describe the Posix accept() function.
\item How does HTTP work?
\item Describe the services provided by TCP.
\item How does TCP connection establishment work?
\item Describe the services provided by UDP.
\item Explain the difference between a regular and a connected UDP socket.
\item How do sockets support the client-server model?
\item Which is better, UDP or TCP? Which one would you use?
\item How does the Domain Name System (DNS) work?
\item How does DNS use caching?
\item How is DNS related to IP?
\end{enumerate}
\section{File systems and I/O}
\label{sec-17}

\begin{enumerate}
\item Given a description of the block size and i-node structure, what is the maximum size of a file?
\item How many i-node operations are required to fetch a file at /path/to/file?
\item What information is stored in an i-node? What information isn’t?
\item What data structure best describes an i-node?
\item What are the advantages and disadvantages of an i-node based file system?
\item Given the description of an i-node file system, how many i-node
   accesses are required to read the entire contents of a file of a
   given size? How many blocks does this file consume on disk?
\item What is an advantage of a soft link over a hard link?
\item What is I/O polling? What are advantages and disadvantages?
\item Describe disk I/O access using DMA.
\item How are file descriptors shared between threads in a single
    process? How are they shared between after a process executes a fork()?
\item When the size of a block changes in an i-node based file system,
    how does this change the maximum size of a file?
\item How do polling and interrupt driven I/O differ? What are the
    advantages and disadvantages of each?
\item How does the page-out process work?
\item Understand how hard-links result in different file names affecting
    the same i-node.
\item If an i-node based file system has a certain number of direct and
    single-indirect blocks, how large is the file?
\item Where does fstat() look to find the information that it returns?
\item How does a file system use caching?
\end{enumerate}

\end{document}